BackEnd/app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["first_name", "salim"], ["last_name", "atiyeh"], ["email", "salimatiyeh@gmail.com"], ["created_at", "2024-01-09 02:50:15.214930"], ["updated_at", "2024-01-09 02:50:15.214930"]]
---
      def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users"
---
      def index
        @users = User.all()